### 数据加载、存储与文件格式

#### 读写文本格式的数据

In [1]:
import pandas as pd

In [4]:
!cat examples/ex1.csv

9,10,11,12,foo

In [7]:
df = pd.read_csv('examples/ex1.csv')

In [8]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
pd.read_table('examples/ex1.csv',sep=",")

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [10]:
!cat examples/ex2.csv

9,10,11,12,foo

In [11]:
pd.read_csv('examples/ex2.csv',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [12]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd',
'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
names = ['a','b','c','d','message']

In [14]:
pd.read_csv('examples/ex2.csv',names=names,index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [15]:
!cat examples/csv_mindex.csv

In [16]:
parsed = pd.read_csv('examples/csv_mindex.csv',
                     index_col=['key1', 'key2'])

In [17]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [19]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [20]:
result = pd.read_table('examples/ex3.txt',sep='\s+')

In [21]:
result 
# 由于列名比数据行的数量少，所以 read_table 推断 第一列应该是 DataFrame 的索引。

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [22]:
!cat examples/ex4.csv

9,10,11,12,foo

In [23]:
pd.read_csv('examples/ex4.csv',skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [24]:
!cat examples/ex5.csv

three,9,10,11,12,foo

In [25]:
result = pd.read_csv('examples/ex5.csv')

In [26]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [27]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [28]:
result = pd.read_csv('examples/ex5.csv',na_values=['NULL'])

In [29]:
result # na_values 这里可以将列表中的值代替缺省值

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [30]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}
pd.read_csv('examples/ex5.csv', na_values=sentinels)
# 从结果可以看出，message列中的foo元素被NA代替了
#something列中的two被代替了

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

#### 逐块读取文本文件

In [31]:
pd.options.display.max_rows = 10 # 限定显示的最大行数

In [32]:
result = pd.read_csv('examples/ex6.csv')

In [33]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [34]:
pd.read_csv('examples/ex6.csv', nrows=5) # 限定想读取的前n行

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [36]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [37]:
chunker

In [38]:
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
tot = tot.sort_values(ascending=False)

In [39]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

#### 将数据写出到文本格式

In [40]:
data = pd.read_csv('examples/ex5.csv')

In [41]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [42]:
data.to_csv('examples/out.csv') # 将数据已csv的形式导出

In [43]:
!cat examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [44]:
import sys

In [45]:
data.to_csv(sys.stdout, sep='|') # sys.stdout 仅仅打印文本结果

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [46]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [47]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [48]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b',
'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [49]:
dates = pd.date_range('1/1/2000', periods=7)
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [51]:
import numpy as np
ts = pd.Series(np.arange(7), index=dates)

In [52]:
ts.to_csv('examples/tseries.csv')

In [53]:
!cat examples/tseries.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

#### 处理分隔符格式

In [54]:
!cat examples/ex7.csv

In [55]:
import csv

In [65]:
f = open('examples/ex7.csv')

In [57]:
reader = csv.reader(f)

In [58]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [59]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [62]:
header, values = lines[0], lines[1:]
print(header)
print(values)

['a', 'b', 'c']
[['1', '2', '3'], ['1', '2', '3']]

In [61]:
data_dict = {h: v for h, v in zip(header,zip(*values))}
data_dict
# zip的用法
# 多个参数，返回一个列表，列表里面的第 i 个元素由多个参数的第 i 个元素组成
# 一个参数，返回一个列表
# 零个参数，返回一个空列表

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [63]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [66]:
reader = csv.reader(f, dialect=my_dialect)

In [68]:
for line in reader:
    print(line)

['a,"b","c"']
['1,"2","3"']
['1,"2","3"']

In [69]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

In [70]:
!cat mydata.csv

one;two;three
1;2;3
4;5;6
7;8;9

#### JSON数据

In [71]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
} """

In [72]:
import json

In [73]:
result = json.loads(obj) # json.loads()将json格式转化为python对象

In [74]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [76]:
json.dumps(result) # 将python对象转化为json格式

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [77]:
siblings = pd.DataFrame(result['siblings'], columns=['name',
'age'])

In [78]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [79]:
!cat examples/example.json

In [80]:
data = pd.read_json('examples/example.json')

In [81]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [82]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [83]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

#### XML 和 HTML:Web 信息收集

In [90]:
import lxml
import html5lib

In [3]:
! pip install beautifulsoup4

Requirement already satisfied: beautifulsoup4 in /Users/yao/anaconda3/lib/python3.7/site-packages (4.7.1)
Requirement already satisfied: soupsieve>=1.2 in /Users/yao/anaconda3/lib/python3.7/site-packages (from beautifulsoup4) (1.8)

In [5]:
from bs4 import BeautifulSoup

In [6]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [7]:
len(tables)

1

In [8]:
tables

[                                  Bank Name             City  ST   CERT  \
 0                               Allied Bank         Mulberry  AR     91
 1              The Woodbury Banking Company         Woodbury  GA  11297
 2                    First CornerStone Bank  King of Prussia  PA  35312
 3                        Trust Company Bank          Memphis  TN   9956
 4                North Milwaukee State Bank        Milwaukee  WI  20364
 5                    Hometown National Bank         Longview  WA  35156
 6                       The Bank of Georgia   Peachtree City  GA  35259
 7                              Premier Bank           Denver  CO  34112
 8                            Edgebrook Bank          Chicago  IL  57772
 9                    Doral Bank  En Espanol         San Juan  PR  32102
 10        Capitol City Bank & Trust Company          Atlanta  GA  33938
 11                  Highland Community Bank          Chicago  IL  20290
 12         First National Bank of Crestview        Crestview  FL  17557
 13                       Northern Star Bank          Mankato  MN  34983
 14   Frontier Bank, FSB D/B/A El Paseo Bank      Palm Desert  CA  34738
 15    The National Republic Bank of Chicago          Chicago  IL    916
 16                           NBRS Financial       Rising Sun  MD   4862
 17                    GreenChoice Bank, fsb          Chicago  IL  28462
 18                 Eastside Commercial Bank          Conyers  GA  58125
 19                   The Freedom State Bank          Freedom  OK  12483
 20                              Valley Bank  Fort Lauderdale  FL  21793
 21                              Valley Bank           Moline  IL  10450
 22              Slavie Federal Savings Bank          Bel Air  MD  32368
 23                    Columbia Savings Bank       Cincinnati  OH  32284
 24             AztecAmerica Bank En Espanol           Berwyn  IL  57866
 25                    Allendale County Bank          Fairfax  SC  15062
 26                       Vantage Point Bank          Horsham  PA  58531
 27    Millennium Bank, National Association         Sterling  VA  35096
 28                             Syringa Bank            Boise  ID  34296
 29                        The Bank of Union          El Reno  OK  17967
 ..                                      ...              ...  ..    ...
 517                       ANB Financial, NA      Bentonville  AR  33901
 518                               Hume Bank             Hume  MO   1971
 519                  Douglass National Bank      Kansas City  MO  24660
 520                       Miami Valley Bank         Lakeview  OH  16848
 521                                 NetBank       Alpharetta  GA  32575
 522               Metropolitan Savings Bank       Pittsburgh  PA  35353
 523                         Bank of Ephraim          Ephraim  UT   1249
 524                           Reliance Bank     White Plains  NY  26778
 525   Guaranty National Bank of Tallahassee      Tallahassee  FL  26838
 526                     Dollar Savings Bank           Newark  NJ  31330
 527                    Pulaski Savings Bank     Philadelphia  PA  27203
 528   First National Bank of Blanchardville   Blanchardville  WI  11639
 529                   Southern Pacific Bank         Torrance  CA  27094
 530             Farmers Bank of Cheneyville      Cheneyville  LA  16445
 531                           Bank of Alamo            Alamo  TN   9961
 532  AmTrade International Bank  En Espanol          Atlanta  GA  33784
 533          Universal Federal Savings Bank          Chicago  IL  29355
 534            Connecticut Bank of Commerce         Stamford  CT  19183
 535                        New Century Bank  Shelby Township  MI  34979
 536                   Net 1st National Bank       Boca Raton  FL  26652
 537                            NextBank, NA          Phoenix  AZ  22314
 538                Oakwood Deposit Bank Co.          Oakwood  OH   8966
 539                   Bank of Sierra Blanca    Sierra Blanca  TX  22002
 540           Hamilton Bank, NA  En Espanol            Miami  FL  24382
 541                  Sinclair National Bank         Gravette  AR  34248
 542                      Superior Bank, FSB         Hinsdale  IL  32646
 543                     Malta National Bank            Malta  OH   6629
 544         First Alliance Bank & Trust Co.       Manchester  NH  34264
 545       National State Bank of Metropolis       Metropolis  IL   3815
 546                        Bank of Honolulu         Honolulu  HI  21029

                    Acquiring Institution        Closing Date  \
 0                           Today's Bank  September 23, 2016
 1                            United Bank     August 19, 2016
 2    First-Citizens Bank & Trust Company         May 6, 2016
 3             The Bank of Fayette County      April 29, 2016
 4    First-Citizens Bank & Trust Company      March 11, 2016
 5                         Twin City Bank     October 2, 2015
 6                          Fidelity Bank     October 2, 2015
 7              United Fidelity Bank, fsb       July 10, 2015
 8               Republic Bank of Chicago         May 8, 2015
 9           Banco Popular de Puerto Rico   February 27, 2015
 10   First-Citizens Bank & Trust Company   February 13, 2015
 11             United Fidelity Bank, fsb    January 23, 2015
 12                        First NBC Bank    January 16, 2015
 13                             BankVista   December 19, 2014
 14     Bank of Southern California, N.A.    November 7, 2014
 15                   State Bank of Texas    October 24, 2014
 16                           Howard Bank    October 17, 2014
 17                  Providence Bank, LLC       July 25, 2014
 18             Community & Southern Bank       July 18, 2014
 19       Alva State Bank & Trust Company       June 27, 2014
 20   Landmark Bank, National Association       June 20, 2014
 21                   Great Southern Bank       June 20, 2014
 22                         Bay Bank, FSB        May 30, 2014
 23             United Fidelity Bank, fsb        May 23, 2014
 24              Republic Bank of Chicago        May 16, 2014
 25                   Palmetto State Bank      April 25, 2014
 26                     First Choice Bank   February 28, 2014
 27                  WashingtonFirst Bank   February 28, 2014
 28                          Sunwest Bank    January 31, 2014
 29                             BancFirst    January 24, 2014
 ..                                   ...                 ...
 517       Pulaski Bank and Trust Company         May 9, 2008
 518                        Security Bank       March 7, 2008
 519       Liberty Bank and Trust Company    January 25, 2008
 520         The Citizens Banking Company     October 4, 2007
 521                           ING DIRECT  September 28, 2007
 522  Allegheny Valley Bank of Pittsburgh    February 2, 2007
 523                        Far West Bank       June 25, 2004
 524                     Union State Bank      March 19, 2004
 525              Hancock Bank of Florida      March 12, 2004
 526                          No Acquirer   February 14, 2004
 527                       Earthstar Bank   November 14, 2003
 528                        The Park Bank         May 9, 2003
 529                            Beal Bank    February 7, 2003
 530            Sabine State Bank & Trust   December 17, 2002
 531                          No Acquirer    November 8, 2002
 532                          No Acquirer  September 30, 2002
 533               Chicago Community Bank       June 27, 2002
 534                   Hudson United Bank       June 26, 2002
 535                          No Acquirer      March 28, 2002
 536                       Bank Leumi USA       March 1, 2002
 537                          No Acquirer    February 7, 2002
 538       The State Bank & Trust Company    February 1, 2002
 539     The Security State Bank of Pecos    January 18, 2002
 540     Israel Discount Bank of New York    January 11, 2002
 541                   Delta Trust & Bank   September 7, 2001
 542                Superior Federal, FSB       July 27, 2001
 543                    North Valley Bank         May 3, 2001
 544  Southern New Hampshire Bank & Trust    February 2, 2001
 545              Banterra Bank of Marion   December 14, 2000
 546                   Bank of the Orient    October 13, 2000

            Updated Date
 0     November 17, 2016
 1     November 17, 2016
 2     September 6, 2016
 3     September 6, 2016
 4         June 16, 2016
 5        April 13, 2016
 6      October 24, 2016
 7       August 17, 2016
 8         July 12, 2016
 9          May 13, 2015
 10       April 21, 2015
 11       April 21, 2015
 12     January 15, 2016
 13      January 6, 2016
 14    November 10, 2016
 15      January 6, 2016
 16       March 26, 2015
 17        July 28, 2015
 18        July 11, 2016
 19       March 25, 2016
 20        June 29, 2015
 21        June 26, 2015
 22        June 15, 2015
 23    November 10, 2016
 24     October 20, 2016
 25        July 18, 2014
 26        March 3, 2015
 27       March 03, 2015
 28       April 12, 2016
 29       March 25, 2016
 ..                  ...
 517     August 28, 2012
 518     August 28, 2012
 519    October 26, 2012
 520  September 12, 2016
 521     August 28, 2012
 522    October 27, 2010
 523       April 9, 2008
 524       April 9, 2008
 525        June 5, 2012
 526       April 9, 2008
 527       July 22, 2005
 528        June 5, 2012
 529    October 20, 2008
 530    October 20, 2004
 531      March 18, 2005
 532  September 11, 2006
 533       April 9, 2008
 534   February 14, 2012
 535      March 18, 2005
 536       April 9, 2008
 537    February 5, 2015
 538    October 25, 2012
 539    November 6, 2003
 540  September 21, 2015
 541   February 10, 2004
 542     August 19, 2014
 543   November 18, 2002
 544   February 18, 2003
 545      March 17, 2005
 546      March 17, 2005

 [547 rows x 7 columns]]

In [9]:
failures = tables[0]

In [10]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [11]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [12]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

#### 利用 lxml.objectify 解析 XML

### 二进制数据格式

In [14]:
frame = pd.read_csv('examples/ex1.csv')

In [15]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [16]:
frame.to_pickle('examples/frame_pickle')

In [17]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [19]:
import numpy as np
frame = pd.DataFrame({'a': np.random.randn(100)})

In [20]:
frame

           a
0   0.147149
1  -0.037523
2  -0.860932
3   0.605639
4   0.319919
5   0.610768
6  -0.129889
7   0.190001
8   1.167188
9   0.421379
10  0.984101
11 -0.358858
12 -0.237995
13  1.097408
14  0.915727
15 -0.159666
16  0.412599
17  1.354889
18 -1.131829
19  1.057255
20 -1.826406
21  1.152381
22  0.609091
23 -1.383215
24  0.461874
25 -0.983808
26  1.702512
27 -0.067170
28 -0.174702
29 -0.515221
..       ...
70 -1.421183
71 -0.947429
72  1.009477
73 -0.071353
74  0.133980
75  0.454751
76 -0.645448
77 -0.310383
78 -0.809012
79 -1.358083
80  0.211168
81 -0.976095
82  1.086327
83  0.226131
84 -0.320279
85  0.304256
86 -0.729432
87  0.540037
88 -1.844881
89 -0.353355
90 -1.402924
91  0.253567
92 -0.977047
93 -0.022249
94 -0.672566
95 -0.878237
96 -1.057263
97 -0.207003
98  0.075269
99  0.314181

[100 rows x 1 columns]

In [21]:
store = pd.HDFStore('mydata.h5')

In [22]:
store['obj1'] = frame

In [23]:
store['obj1_col'] = frame['a']

In [24]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [25]:
store['obj1']

           a
0   0.147149
1  -0.037523
2  -0.860932
3   0.605639
4   0.319919
5   0.610768
6  -0.129889
7   0.190001
8   1.167188
9   0.421379
10  0.984101
11 -0.358858
12 -0.237995
13  1.097408
14  0.915727
15 -0.159666
16  0.412599
17  1.354889
18 -1.131829
19  1.057255
20 -1.826406
21  1.152381
22  0.609091
23 -1.383215
24  0.461874
25 -0.983808
26  1.702512
27 -0.067170
28 -0.174702
29 -0.515221
..       ...
70 -1.421183
71 -0.947429
72  1.009477
73 -0.071353
74  0.133980
75  0.454751
76 -0.645448
77 -0.310383
78 -0.809012
79 -1.358083
80  0.211168
81 -0.976095
82  1.086327
83  0.226131
84 -0.320279
85  0.304256
86 -0.729432
87  0.540037
88 -1.844881
89 -0.353355
90 -1.402924
91  0.253567
92 -0.977047
93 -0.022249
94 -0.672566
95 -0.878237
96 -1.057263
97 -0.207003
98  0.075269
99  0.314181

[100 rows x 1 columns]

In [26]:
store.put('obj2', frame, format='table')

In [27]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10  0.984101
11 -0.358858
12 -0.237995
13  1.097408
14  0.915727
15 -0.159666

In [28]:
store.close()

In [29]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [30]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0  0.147149
1 -0.037523
2 -0.860932
3  0.605639
4  0.319919

>如果需要本地处理海量数据，我建议你好好研究一下
PyTables 和 h5py

>注意:HDF5 不是数据库。它最适合用作“一次写多次读”的数据集。虽然数据 可以在任何时候被添加到文件中，但如果同时发生多个写操作，文件就可能会 被破坏。

### 读取 Microsoft Excel 文件

In [31]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [32]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [33]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')

In [34]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [35]:
writer = pd.ExcelWriter('examples/ex2.xlsx')

In [36]:
frame.to_excel(writer, 'Sheet1')

In [37]:
writer.save()

In [38]:
frame.to_excel('examples/ex2.xlsx')

### Web APIs 交互

In [39]:
import requests

In [41]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [42]:
resp = requests.get(url)

In [43]:
resp

In [44]:
data = resp.json()

In [45]:
data[0]['title']

'Clean Up Testing of Excel Engine Option Setting for Readers/Writers'

In [46]:
issues = pd.DataFrame(data, columns=['number','title','labels','state'])

In [47]:
issues

,number,title,labels,state
0,27096,Clean Up Testing of Excel Engine Option Settin...,"[{'id': 49254273, 'node_id': 'MDU6TGFiZWw0OTI1...",open
1,27095,Shorter truncated Series/DataFrame repr: intro...,"[{'id': 13101118, 'node_id': 'MDU6TGFiZWwxMzEw...",open
2,27094,CLN: Assorted cleanups,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
3,27093,Change in column name creates an empty output ...,[],open
4,27092,Update visualization.rst,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
5,27091,Enhancement: The shift function should have an...,[],open
6,27090,ENH: allow non-Tick offsets in index.round/cei...,"[{'id': 53181044, 'node_id': 'MDU6TGFiZWw1MzE4...",open
7,27087,"WIP: Add DayEnd, DayBegin Offsets (Help Wanted)","[{'id': 53181044, 'node_id': 'MDU6TGFiZWw1MzE4...",open
8,27085,TST: Split test_offsets.py,"[{'id': 53181044, 'node_id': 'MDU6TGFiZWw1MzE4...",open
9,27084,DEPR: msgpack,"[{'id': 87485152, 'node_id': 'MDU6TGFiZWw4NzQ4...",open
10,27081,API: .equals for Extension Arrays,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
11,27080,Bug in SparseArray.__array_ufunc__ for reduce,[],open
12,27078,DOC/TST: provide documentation & testing on gr...,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
13,27076,Blacken the code base,"[{'id': 77550281, 'node_id': 'MDU6TGFiZWw3NzU1...",open
14,27075,Groupby ignores unobserved combinations when p...,[],open
15,27073,ENH: Json fill_value for missing fields,"[{'id': 49379259, 'node_id': 'MDU6TGFiZWw0OTM3...",open
16,27072,[POC] CLN: use ExtensionBlock for datetime tz ...,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open
17,27070,Add semantic analyser,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open
18,27069,Feature request: make read_parquet support rea...,[],open
19,27068,TST: change assertion messages in assert_frame...,"[{'id': 42670965, 'node_id': 'MDU6TGFiZWw0MjY3...",open
20,27067,DOC: Exception raised if columns do not match ...,"[{'id': 1049312478, 'node_id': 'MDU6TGFiZWwxMD...",open
21,27062,CI: Use conda compiler in `environment.yml`,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
22,27060,POC: add .ll indexer for pythonic label-based ...,[],open
23,27059,Discussion: Why is loc label-based slicing rig...,[],open
24,27058,ENH: Chaining method for assigning a new index,[],open
25,27057,rolling(offset) treats duplicated Timestamps i...,[],open
26,27056,Missing narrow-unicode Python 2.7 wheels,[],open
27,27055,DOC: Validation of docsting validates Python t...,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
28,27054,DOC: Fix pipe example in the Essential basic f...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
29,27052,sharey and tick_params: top row not impacted,[],open

### 数据库交互

In [48]:
import sqlite3 # 下面的一系列的操作比较有意思

In [49]:
query = """
   CREATE TABLE test
   (a VARCHAR(20), 
    b VARCHAR(20),
    c REAL,        
    d INTEGER
   );"""

In [50]:
con = sqlite3.connect('mydata.sqlite')

In [51]:
con.execute(query)

In [52]:
con.commit()

In [53]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]

In [54]:
stmt = "INSERT INTO test VALUES(?,?,?,?)"

In [55]:
con.executemany(stmt, data)

In [56]:
cursor = con.execute('select * from test')

In [57]:
rows = cursor.fetchall()

In [58]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [59]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [60]:
pd.DataFrame(rows, columns=[x[0] for x in
cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [61]:
import sqlalchemy as sqla

In [62]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [63]:
pd.read_sql('select * from test', db)

Empty DataFrame
Columns: [a, b, c, d]
Index: []